================================================================================
Tag with variable
================================================================================

tag(attr=VARIABLE, attr=VARIABLE)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with number
================================================================================

tag(attr=1)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with double quote string
================================================================================

tag(attr="string", attr="string")

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (string))
      (attribute
        (attribute_name)
        (string)))))

================================================================================
Tag with single quote string
================================================================================

tag(attr='string', attr='string')

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (string))
      (attribute
        (attribute_name)
        (string)))))

================================================================================
Tag with template string
================================================================================

tag(attr=`string ${variable} string`, attr=`string ${variable} string`)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with array
================================================================================

tag(attr=[1, 2, 3], attr=[1,2,3])

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with object
================================================================================

tag(attr={key: 'value', key: 'value'}, attr={key: 'value', key: 'value'})

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with function call
================================================================================

tag(attr=getValue(), attr=getValue())

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with nested function call
================================================================================

tag(attr=getValue(getOtherValue()))

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with chained function call
================================================================================

tag(attr=getValue(getOtherValue().getValue()).getType())

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with a deeply nested and chained function call attribute
================================================================================

tag(attr=getValue(getOtherValue(variable.getType(   valueKey   )).getValue('this_user')).getType(2 ^^ 6 || 9))

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with deeply nested and chained function call attributes
================================================================================

tag(
  attr=getValue(getOtherValue(variable.getType(   valueKey   )).getValue('this_user')).getType(2 ^^ 6 || 9)
  otherattr=getValue(getOtherValue(variable.getType(   valueKey   )).getValue('this_user')).getType(2 ^^ 6 || 9)
)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with operator on variables
================================================================================

tag(attr=number + number, attr=getValue() * 2)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with operator on variables without comma separation
================================================================================

tag(attr=number + number attr=value || value)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with operator on strings
================================================================================

tag(attr='string' + "string")

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag operator on strings and variables
================================================================================

tag(attr='hello' + goodbye)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with operator on mixed types
================================================================================

tag(attr='string' + "string" * number || [1, 2, 3] - {key: 'value'}, attr=25 && 2)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with operator on mixed types without comma separation
================================================================================

tag(attr='string' + "string" * number || [1, 2, 3] - {key: 'value'} attr=25 && 2)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with ternary with operator
================================================================================

tag(attr=variable + 10 ? [1, 2, 3] || false : "string?string:" * 100, attr=condition ? true : false)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))

================================================================================
Tag with ternary with operator without comma separation
================================================================================

tag(attr=variable + 10 ? [1, 2, 3] || false : "string?string:" * 100 attr=condition ? true : false)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (attribute
        (attribute_name)
        (javascript))
      (attribute
        (attribute_name)
        (javascript)))))
